import React from "react";
import "./publicOfferContainer.scss"

const PublicOfferContainer = () => {
    return (
        <div className="publick">
            <div className="container">
                <div className="publick__general">
                    <ol>
                        <h1 className="publick__main-title">Публічна оферта</h1>
                        <p className="publick__text">За цим Договором одна сторона Продавець з одного боку, і будь-яка особа, яка прийняла умови цього Договору публічної оферти - Покупець, з іншого боку, далі спільно названі - Сторони, уклали цей Договір публічної оферти (далі - Договір), адресований необмеженому колу офіційним публічним реченням Продавця укласти з Покупцями договір купівлі-продажу Товарів, фотографії яких розміщені у відповідному розділі Веб-сайту http://hub.com.ua/</p>
                        <p className="publick__text">Продавці, які мають намір здійснювати продаж Товарів за допомогою Веб-сайту http://hub.com.ua/ та Покупці при придбанні Товарів, зображення яких розміщені на відповідних сторінках http://hub.com.ua/, приймають умови цього Договору про наведене нижче.</p>
                        <li><b>Загальні положення</b>
                            <ol className="publick__list">
                                <li>Договірні відносини між Продавцем та Покупцем оформлюються у вигляді Договору публічної оферти. Натискання на сторінці Веб-сайту http://hub.com.ua/ у відповідному розділі кнопки «оформити замовлення» означає, що Покупець, незалежно від статусу (фізична особа, юридична особа, фізична особа-підприємець), згідно з чинним законодавством України, взяв до виконання умови Договору публічної оферти, зазначені нижче.</li>
                                <li>Договір публічної оферти є публічним. За повною згодою з цим Договором Покупець приймає умови та порядок оформлення замовлення, оплати та доставки товару Продавцем, відповідальності за недобросовісне Замовлення та за невиконання умов цього Договору.</li>
                                <li>Цей Договір набирає чинності з моменту натискання на кнопку «оформити замовлення» або «швидке замовлення», яким Покупець дає згоду здійснити покупку наявного Продавця Товару та діє до моменту отримання Покупцем Товару від Продавця та повного розрахунку з ним.</li>
                                <li>Для регулювання договірних правовідносин за Договором Сторони обирають та, у разі потреби, застосовують українське законодавство.</li>
                            </ol></li>
                        <li><b className="publick__title">Терміни і визначення</b>
                            <ol className="publick__list">
                                <li><b>«Договір</b> публічної оферти» - публічний договір, зразок якого розміщено на Веб-сайті http://hub.com.ua/.</li>
                                <li><b>«Акцепт»</b> - прийняття Покупцем пропозиції продавця про придбання Товару, зображення якого розміщено на Веб-сайті http://hub.com.ua/, шляхом додавання його до віртуального кошика та надсилання Замовлення.</li>
                                <li><b>«Товар»</b> - предмет торгівлі (виріб, модель, аксесуар, комплектуючі та супутні предмети, будь-які інші предмети торгівлі), про придбання якого на Веб-сайті http://hub.com.ua/ розміщено пропозицію продавця.</li>
                                <li><b>«Покупець»</b> - будь-яка дієздатна фізична, юридична особа, фізична особа-підприємець, згідно з чинним міжнародним та українським законодавством, які відвідали Веб-сайт http://hub.com.ua/ та мають намір придбати той чи інший Товар.</li>
                                <li><b>«Продавець»</b> - будь-яка дієздатна фізична, юридична особа, фізична особа-підприємець, згідно з чинним українським законодавством, які є власниками або розповсюджувачами Товару та за допомогою Веб-сайту http://hub.com.ua/ мають намір його продати.</li>
                                <li><b>«Замовлення»</b> - належним чином оформлена та розміщена на Веб-сайті http://hub.com.ua/ заявка Покупця на купівлю Товарів, що адресується продавцю.</li>
                            </ol></li>
                        <li><b>Предмет договору</b>
                            <ol className="publick__list">
                                <li>Продавець зобов'язується на умовах та в порядку, визначених цим Договором продати Товар на основі Замовлення, оформленого Покупцем на відповідній сторінці Веб-сайту http://hub.com.ua/, а Покупець зобов'язується на умовах та в порядку, визначених цим Договором, купити Товар та сплатити за нього кошти.</li>
                                <li>Продавець гарантує, що Товар не передано в заставу, він не є предметом спору, не перебуває під арештом, а також на нього відсутні будь-які права третіх осіб.</li>
                                <li>Продавець і Покупець підтверджують, що чинний Договір не є фіктивним або удаваним правочином, або угодою, вчиненою під впливом тиску або обману.</li>
                                <li>Продавець підтверджує, що має всі необхідні дозволи на провадження господарської діяльності, які регулюють сферу правовідносин, що виникають та діють у процесі виконання цього Договору, а також гарантує, що має право на виробництво та/або реалізацію товару без будь-яких обмежень, та зобов'язується нести відповідальність у разі порушення прав Покупця у процесі виконання цього Договору та реалізації Товару.</li>
                            </ol></li>
                        <li><b>Права і обов’язки Продавця</b>
                            <ol className="publick__list">
                                <li>Продавець зобов'язаний:</li>
                                <ol className="publick__sub-list">
                                    <li>виконувати умови цього Договору;</li>
                                    <li>виконувати замовлення Покупця у разі надходження оплати від Покупця;</li>
                                    <li>передати Покупцеві Товар згідно з обраним зразком на відповідній сторінці Веб-сайту http://hub.com.ua/, оформленим замовленням та умовами цього Договору;</li>
                                    <li>перевірити якісні та кількісні характеристики Товару під час його упаковки на складі;</li>
                                    <li>повідомити покупця про можливу додаткову комісію при оплаті замовлень картами типу Mastercard, Visa, Visa Electron, Mastercard Electronic, Maestro шляхом інформування в цьому договорі.</li>
                                </ol></ol>
                            <li>Продавець має право:
                                <ol>
                                    <li>в односторонньому порядку призупинити надання послуг за цим Договором у разі порушення Покупцем умов цього Договору.</li>
                                </ol></li>
                            <li>Або Суб'єкт господарювання з-поміж осіб, які пропонують до придбання на Веб-сайті http://hub.com.ua/, Товар за єдиними узгодженими правилами, викладеними в цьому договорі публічної оферти.*</li>
                        </li>
                        <li><b>Права і обов’язки Покупця</b>
                            <ol className="publick__list">
                                <li>Покупець зобов'язаний:
                                    <ol className="publick__sub-list">
                                        <li>своєчасно оплатити та отримати замовлення на умовах цього Договору;</li>
                                        <li>ознайомитися з інформацією про Товар, розміщений на Веб-сайті http://hub.com.ua/;</li>
                                        <li>при отриманні Товару в особи, яка здійснила його доставку, переконатися у цілісності та комплектності Товару шляхом огляду вмісту упаковки. У разі пошкодження або неповної комплектації Товару - зафіксувати їх в акті, який разом із Покупцем має підписати особа, яка здійснила її доставку Покупцю.</li>
                                    </ol></li>
                                <li>Покупець має право:
                                    <ol className="publick__sub-list">
                                        <li>оформити замовлення на відповідній сторінці Веб-сайту http://hub.com.ua/;</li>
                                        <li>вимагати від продавця виконання умов цього Договору;</li>
                                        <li>на інформування про можливу додаткову комісію при оплаті європейських замовлень картами типу Mastercard, Visa, Visa Electron, Mastercard Electronic, Maestro.</li>
                                    </ol></li>
                            </ol></li>
                        <li><b>Порядок оформлення замовлення</b>
                            <ol className="publick__list">
                                <li>Покупець самостійно оформляє замовлення на відповідній сторінці Веб-сайту http://hub.com.ua/ шляхом додавання Товарів до віртуального кошика або зробивши замовлення електронною поштою, або за номером телефону, вказаним у розділі контактів Веб-сайту http://hub.com.ua/</li>
                                <li>Термін формування Замовлення до 3 робочих днів із моменту його оформлення. У разі, якщо замовлення відправлено у вихідний день або поза робочий час, термін формування починається з першого після вихідного робочого дня.</li>
                            </ol></li>
                        <li><b>Ціна договору і порядок оплати</b>
                            <ol>

                                <li>Ціна кожного окремого Товару визначається Продавцем та вказується на відповідній сторінці Веб-сайту http://hub.com.ua/. Ціна Договору визначається шляхом складання цін усіх вибраних Товарів, поміщених у віртуальний кошик та ціни доставки, що визначається залежно від способу доставки, відповідно до умов розділу 8 цього Договору.</li>
                                <li>Вартість Замовлення може змінюватись в залежності від ціни, кількості або номенклатури товару.</li>
                                <li>Покупець може сплатити замовлення такими способами:</li>
                                <ol>
                                    <li>за допомогою банківського переказу грошей на поточний рахунок Продавця, зазначений у рахунку, у т.ч. за допомогою Інтернет-банкінгу (Покупець оплачує замовлення протягом двох днів із дати отримання рахунку у розмірі 100% передоплати).</li>
                                    <li>будь-яким іншим способом за домовленістю з Продавцем.</li>
                                </ol>
                                <li>При оплаті Покупцем замовлення платіжною карткою можливе стягнення додаткової комісії емітентом цієї картки, зокрема, при сплаті Покупцем замовлення платіжною карткою можливе стягнення додаткової комісії. При натисканні на сторінці Веб-сайту http://hub.com.ua/ у відповідному розділі кнопки «оформити замовлення» означає, що Продавець повідомив Покупця про можливість стягнення додаткової комісії під час оплати Покупцем.</li>
                            </ol></li>
                        <li><b>Умови доставки товару</b>
                            <ol>
                                <li>Покупець отримує Товар за допомогою доставки або отримує його особисто. Порядок оплати та отримання вказано на відповідній сторінці Веб-сайту http://hub.com.ua/.</li>
                                <li>При доставці Товарів до інших міст України, що виконується іншими Службами доставки (далі Компаніями-перевізниками) Покупець у повному обсязі та беззастережно погоджується з Правилами перевезення вантажів цими компаніями-перевізниками.</li>
                                <li>Факт отримання Товару та відсутність претензій до якості Товару, що доставляється Компаніями-перевізниками, Покупець підтверджує власним підписом у товарно-транспортній накладній, декларації Компанії-перевізника або у видатковій накладній при отриманні Товару. Зі свого боку, Продавець гарантує відвантаження Товару Компанії-перевізнику у кількості, зазначеній та оплаченій Покупцем, у комплектності згідно специфікації цього Товару та у належному (робочому) стані та якості.</li>
                                <li>У разі відсутності Покупця за адресою доставки, вказаною Покупцем у заявці або відмови Покупця від отримання Товару з необґрунтованих причин, при доставці Кур'єром компанії-перевізника, Товар повертається до центру відвантаження. Оплата за послуги Компанії-перевізника віднімається із суми, перерахованої Покупцем за Товар. Залишок суми повертається Покупцеві на підставі його листа, надісланого на e-mail: yana.petrenko.hub@gmail.com із зазначенням розрахункового рахунку, на який мають бути повернені кошти.</li>
                            </ol></li>
                        <li><b>Умови повернення товару</b>
                            <ol>
                                <li>Відповідно до ст. 9 Закону України «Про захист прав споживачів», Покупець має право на обмін Товару належної якості протягом чотирнадцяти днів, за винятком дня покупки, якщо більш тривалий термін не оголошений Продавцем.</li>
                                <li>Якщо Покупець має намір повернути Товар, таке повернення здійснюється з урахуванням правил та умов перевізника або кур'єра, що діють на території України.</li>
                                <li>У разі придбання товару неналежної якості, Покупець зобов'язаний зафіксувати всі його дефекти у складеному акті довільної форми. Акт повинен бути підписаний Покупцем та особою, яка здійснила доставку Товару або Продавцем. За можливості недоліки повинні бути зафіксовані засобами фото- або відеозйомки. Протягом 12 годин з моменту отримання товару Покупець зобов'язаний інформувати менеджера (представника Продавця відповідального за оформлення замовлення на Товар) про виявлені недоліки та домовитись про заміну Товару.</li>
                                <li>Сторони погодили, що у разі недотримання обов'язкових вимог зазначеної процедури визнається отримання Покупцем Товару у належному стані – без будь-яких механічних пошкоджень та у повній комплектності.</li>
                            </ol></li>
                        <li><b>Відповідальність сторін та вирішення спорів</b>
                            <ol>
                                <li>Сторони несуть відповідальність за невиконання або неналежне виконання умов цього Договору у порядку, передбаченому цим Договором та чинним законодавством України.</li>
                                <li>У разі виникнення спорів, пов'язаних із виконанням Сторонами цього Договору, за винятком спорів про стягнення заборгованості з Покупця, Сторони зобов'язуються вирішувати їх шляхом переговорів із дотриманням претензійного порядку. Термін розгляду претензії – 7 (сім) календарних днів з дати її отримання. По суперечках у зв'язку із стягненням заборгованості з Покупця дотримання претензійного порядку не вимагається.</li>
                            </ol></li>
                        <li><b>Форс-мажорні обставини</b>
                            <ol>
                                <li>Сторони не несуть відповідальності за невиконання будь-яких своїх зобов'язань, за винятком зобов'язань з оплати, якщо доведуть, що таке невиконання було викликане форс-мажорними обставинами. До форс-мажорних обставин відносяться, зокрема, природні катаклізми, страйки, пожежі, повені, вибухи, зледеніння, війни (як оголошені, так і неоголошені), заколоти, гибель товару, затримки перевізників, спричинені аваріями або несприятливими погодними умовами, випадки на морі, ембарго, катастрофи, обмеження, що накладаються державними органами (включаючи розподіли, пріоритети, офіційні вимоги, квоти та ціновий контроль), якщо ці обставини безпосередньо вплинули на виконання цього Договору.</li>
                                <li>Сторона, для якої стало неможливим виконання зобов'язань за цим Договором через настання форс-мажорних обставин, повинна негайно інформувати іншу Сторону письмово про виникнення вищезгаданих обставин, а також протягом 30 (тридцяти) календарних днів надати іншій Стороні підтвердження форс-мажорних причин. Таким підтвердженням буде довідка, сертифікат або інший відповідний документ, виданий уповноваженим державним органом, розташованим за місцем виникнення форс-мажорних обставин.</li>
                                <li>Час, який потрібний Сторонам для виконання своїх зобов'язань за цим Договором, буде продовжено на будь-який термін, протягом якого було відкладено виконання через перераховані обставини.</li>
                                <li>Якщо через дії обставин непереборної сили невиконання зобов'язань за цим Договором триває більше трьох місяців, кожна Сторона має право розірвати цей Договір в односторонньому порядку, письмово повідомивши про це іншу сторону.</li>
                                <li>Незважаючи на настання форс-мажору, перед припиненням цього Договору внаслідок форс-мажорних обставин Сторони здійснюють остаточні взаєморозрахунки.</li>
                            </ol></li>
                        <li><b>Інші умови договору</b>
                            <ol>
                                <li>Інформація, що надається Покупцем, є конфіденційною. Інформація про Покупця використовується виключно для виконання його Замовлення (надсилання повідомлення продавцеві про замовлення Товару, відправлення рекламних повідомлень тощо).</li>
                                <li>Власним акцептуванням Договору або реєстрацією на Веб-сайті http://hub.com.ua/, (заповнення реєстраційної анкети) Покупець добровільно дає згоду на збір та обробку своїх персональних даних з наступною метою: дані, що стають відомими, будуть використовуватись у комерційних цілях, у тому числі для обробки замовлень на придбання товарів, отримання інформації про замовлення, розсилки телекомунікаційними засобами зв'язку (електронною поштою, мобільним зв'язком) рекламних та спеціальних пропозицій, інформації про акції, розіграші або будь-яку іншу інформацію про діяльність Веб-сайту http://hub.com.ua/</li>
                                <li>Для цілей, передбачених цим пунктом, Покупцю мають право надсилатися листи, повідомлення та матеріали на поштову адресу, e-mail Покупця, а також надсилатися SMS-повідомлення, здійснювати дзвінки на вказаний в анкеті телефонний номер.</li>
                                <li>Покупець дає право здійснювати обробку його персональних даних, у тому числі: поміщати персональні дані до баз даних (без додаткового повідомлення про це), здійснювати довічне зберігання даних, їх накопичення, оновлення, зміну (при необхідності). Продавець зобов'язується забезпечити захист даних від несанкціонованого доступу третіх осіб, не розповсюджувати та не передавати дані будь-якій третій стороні (крім передачі даних пов'язаним особам, комерційним партнерам, особам, уповноваженим Продавцем на здійснення безпосередньої обробки даних для зазначених цілей, а також на обов'язковий запит компетентного державного органу).</li>
                                <li>У разі небажання отримувати розсилку, Покупець має право звернутися до Продавця, написавши заяву про відмову від отримання рекламних матеріалів, надіславши його на поштову або електронну адресу.</li>
                                <li>Продавець не несе відповідальності за зміст та достовірність інформації, що надається Покупцем під час оформлення замовлення. Покупець відповідає за достовірність зазначеної при оформленні замовлення інформації.</li>
                            </ol></li>
                        <li><b>Реквізити Продавця</b>
                            <ol>
                                <li>ФОП Петренко Яна Олександрівна</li>
                                <li>ЄДРПОУ: 3409207081</li>
                                <li>Банківські реквізити:</li>
                                <li>АТ Приват Банк</li>
                            </ol></li>
                    </ol>
                </div>
            </div>
        </div>
    )
}

export default PublicOfferContainer;