export const SHOSE_DESC = "Купити якісне жіноче взуття зі шкіри, підібрати розмір онлайн. Можливість повернути товар.";
export const CLOTHES_DESC = "Купити жіночий одяг: сукню, блузу, брюки, костюм в онлайн магазині H.U.B. Доможемо підібрати розмір онлайн. Можливість повернення.";
export const ACCESSORIS_DESC = "Шкіряні сумки купити онлайн. Cтильний дизайн, натуральні матеріали. Доставка по Україні.";
export const SALE_DESC = "Товари зі знижками купити онлайн. Краща ціна. Знижки на одяг. Sale.";
export const BLOG_DESC = "Новини моди, все про стиль та жіночий одяг - Магазин жіночого одягу від українських брендів H.U.B. Допоможемо підібрати розмір онлайн. Примірка вдома.  Легке повернення. Доставка по Україні та за її межі.";